haskell/system_filepath.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Module: System.FilePath</title>
<!-- 2016-03-22 Tue 04:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Caio Rodrigues" />
<link href="/Functional-Programming/theme/style.css" rel="stylesheet">


</head>
<body>
<div id="content">
<h1 class="title">Module: System.FilePath</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. System.FilePath</a></li>
</ul>
</div>
</div>
<lu> 
  <li><a href="/Functional-Programming/README.html">Index</a></li>
  <li><a href="https://github.com/caiorss/Functional-Programming">Repository</a></li>
</lu>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> System.FilePath</h2>
<div class="outline-text-2" id="text-1">
<p>
A library for FilePath manipulations, using Posix style paths on all
platforms. Importing System.FilePath is usually
better. (Documentation)
</p>

<ul class="org-ul">
<li><a href="https://hackage.haskell.org/package/filepath-1.4.1.0/docs/System-FilePath.html">Module Documentation</a> 
</li>
</ul>

<p>
Examples:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">System.FilePath</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">SF</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">System.FilePath</span>  ((<span class="org-haskell-operator">&lt;.&gt;</span>)<span class="org-haskell-operator">,</span> (<span class="org-haskell-operator">&lt;/&gt;</span>))
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> 
<span class="org-comment-delimiter">-- </span><span class="org-comment">Type tab to complete </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.-&lt;.&gt;</span>                       <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>hasTrailingPathSeparator   <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>replaceExtension
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.&lt;.&gt;</span>                        <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>isAbsolute                 <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>replaceFileName
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.&lt;/&gt;</span>                        <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>isDrive                    <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>searchPathSeparator
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span><span class="org-haskell-constructor">FilePath</span>                   <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>isExtSeparator             <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>splitDirectories
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>addExtension               <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>isPathSeparator            <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>splitDrive
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>addTrailingPathSeparator   <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>isRelative                 <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>splitExtension
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>combine                    <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>isSearchPathSeparator      <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>splitExtensions
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>dropDrive                  <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>isValid                    <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>splitFileName
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>dropExtension              <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>joinDrive                  <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>splitPath
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>dropExtensions             <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>joinPath                   <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>splitSearchPath
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>dropFileName               <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>makeRelative               <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeBaseName
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>dropTrailingPathSeparator  <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>makeValid                  <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeDirectory
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>equalFilePath              <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>normalise                  <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeDrive
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>extSeparator               <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>pathSeparator              <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeExtension
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>getSearchPath              <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>pathSeparators             <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeExtensions
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>hasDrive                   <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>replaceBaseName            <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeFileName
<span class="org-haskell-constructor">SF</span><span class="org-haskell-definition">.</span>hasExtension               <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>replaceDirectory
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">:</span>info <span class="org-haskell-constructor">SF.FilePath</span> 
<span class="org-haskell-keyword">type</span> <span class="org-haskell-constructor">FilePath</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">String</span>  <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;GHC.IO&#8217;</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>pathSeparator
<span class="org-string">'/'</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>pathSeparators
<span class="org-string">"/"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>splitExtension <span class="org-string">"/boot/grub/grub.cfg"</span>
(<span class="org-string">"/boot/grub/grub"</span><span class="org-haskell-operator">,</span><span class="org-string">".cfg"</span>)
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeExtension <span class="org-string">"/boot/grub/grub.cfg"</span>
<span class="org-string">".cfg"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeExtension <span class="org-string">"/boot/grub/grub"</span>
<span class="org-string">""</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>replaceExtension  <span class="org-string">"/boot/grub/grub.cfg"</span> <span class="org-string">".bin"</span>
<span class="org-string">"/boot/grub/grub.bin"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>replaceExtension  <span class="org-string">"/boot/grub/grub"</span> <span class="org-string">".bin"</span>
<span class="org-string">"/boot/grub/grub.bin"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>replaceExtension  <span class="org-string">"/boot/grub/grub.tar.gz"</span> <span class="org-string">".bin"</span>
<span class="org-string">"/boot/grub/grub.tar.bin"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>dropExtension  <span class="org-string">"/boot/grub/grub.cfg"</span> 
<span class="org-string">"/boot/grub/grub"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>


<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>hasExtension  <span class="org-string">"/boot/grub/grub.cfg"</span> 
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>hasExtension  <span class="org-string">"/boot/grub/grub"</span> 
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-comment-delimiter">--  </span><span class="org-comment">Add an extension, even if there is already one there, equivalent</span>
<span class="org-comment-delimiter">--  </span><span class="org-comment">to addExtension.</span>
<span class="org-comment-delimiter">--</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-string">"/etc/grub"</span> <span class="org-haskell-operator">&lt;.&gt;</span> <span class="org-string">".cfg"</span>
<span class="org-string">"/etc/grub.cfg"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeFileName <span class="org-string">"/boot/grub/grub.cfg"</span> 
<span class="org-string">"grub.cfg"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>replaceFileName   <span class="org-string">"/boot/grub/grub.cfg"</span> <span class="org-string">"dummy.tar.gz"</span>
<span class="org-string">"/boot/grub/dummy.tar.gz"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>dropFileName   <span class="org-string">"/boot/grub/grub.cfg"</span> 
<span class="org-string">"/boot/grub/"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeBaseName    <span class="org-string">"/boot/grub/grub.cfg"</span> 
<span class="org-string">"grub"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Get the directory name, move up one level.</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeDirectory   <span class="org-string">"/boot/grub/grub.cfg"</span> 
<span class="org-string">"/boot/grub"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeDirectory   <span class="org-string">"~"</span> 
<span class="org-string">"."</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeDirectory   <span class="org-string">"/"</span> 
<span class="org-string">"/"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeDirectory   <span class="org-string">"."</span> 
<span class="org-string">"."</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>takeDirectory   <span class="org-string">".."</span> 
<span class="org-string">"."</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-comment-delimiter">--  </span><span class="org-comment">Set the directory, keeping the filename the same.</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>replaceDirectory  <span class="org-string">"/boot/grub/grub.cfg"</span> <span class="org-string">"~"</span>
<span class="org-string">"~/grub.cfg"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Join Path </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>combine <span class="org-string">"/boot/"</span> <span class="org-string">"grub/grub.cfg"</span>
<span class="org-string">"/boot/grub/grub.cfg"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>combine <span class="org-string">"/boot/"</span> <span class="org-string">"/grub/grub.cfg"</span>
<span class="org-string">"/grub/grub.cfg"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>combine <span class="org-string">"/boot"</span> <span class="org-string">"grub/grub.cfg"</span>
<span class="org-string">"/boot/grub/grub.cfg"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Operator to Join Path </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">:</span>t (<span class="org-haskell-operator">&lt;/&gt;</span>)
(<span class="org-haskell-definition">&lt;/&gt;</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">FilePath</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">FilePath</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">FilePath</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-string">"/boot"</span> <span class="org-haskell-operator">&lt;/&gt;</span> <span class="org-string">"grub/grub.cfg"</span>
<span class="org-string">"/boot/grub/grub.cfg"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 



<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>splitPath <span class="org-string">"/boot/grub/grub.cfg"</span>
[<span class="org-string">"/"</span><span class="org-haskell-operator">,</span><span class="org-string">"boot/"</span><span class="org-haskell-operator">,</span><span class="org-string">"grub/"</span><span class="org-haskell-operator">,</span><span class="org-string">"grub.cfg"</span>]
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>joinPath [<span class="org-string">"/"</span><span class="org-haskell-operator">,</span><span class="org-string">"boot/"</span><span class="org-haskell-operator">,</span><span class="org-string">"grub/"</span><span class="org-haskell-operator">,</span><span class="org-string">"grub.cfg"</span>]
<span class="org-string">"/boot/grub/grub.cfg"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 


<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>splitDrive <span class="org-string">"/boot/grub/grub.cfg"</span>
(<span class="org-string">"/"</span><span class="org-haskell-operator">,</span><span class="org-string">"boot/grub/grub.cfg"</span>)
<span class="org-haskell-operator">&gt;&gt;&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">(Running in Linux)</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">SF</span><span class="org-haskell-operator">.</span>splitDrive <span class="org-string">"C:\\boot\\grub\\grub.cfg"</span>
(<span class="org-string">""</span><span class="org-haskell-operator">,</span><span class="org-string">"C:\\boot\\grub\\grub.cfg"</span>)
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Caio Rodrigues</p>
<p class="date">Created: 2016-03-22 Tue 04:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>